# EXL_SetCellNumber

## Description
Write the cell value as a number.

```pascal
FUNCTION EXL_SetCellNumber(
				sheetIndex : INTEGER;
				cellRow    : INTEGER;
				cellColumn : INTEGER;
				value      : REAL): BOOLEAN;
```

```python
def vs.EXL_SetCellNumber(sheetIndex, cellRow, cellColumn, value):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|sheetIndex|INTEGER|   |
|cellRow|INTEGER|   |
|cellColumn|INTEGER|   |
|value|REAL|   |

## Version
Availability: from Vectorworks 2021

## Category
* Excel